polkit-libvirt.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-31 Wed 22:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>polkit libvirt rules</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">polkit libvirt rules</h1>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> security considerations</h2>
<div class="outline-text-2" id="text-1">
<p>
polkit does not exactly have a great track record when it comes to
security, if you use this you probably want to update your system
frequently.
</p>

<p>
also, just my humble opinion, but javascript does not seem like a very
good idea to use to regulate privileges
</p>
</div>
</div>

<div id="outline-container-org0000003" class="outline-2">
<h2 id="org0000003"><span class="section-number-2">2.</span> restricting vm access to username prefixes</h2>
<div class="outline-text-2" id="text-2">
<p>
these polkit rules make it so that vms can be somewhat managed in a
multi-user setting. ie user <code>xfnw</code> will be able to access a vm named
<code>xfnw-catbox</code> but not one named <code>cheapie-catbox</code>
</p>
</div>

<div id="outline-container-org0000001" class="outline-3">
<h3 id="org0000001"><span class="section-number-3">2.1.</span> groups</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><code>virtusers</code> only have access to vms with names that start with their
username plus a dash, and the allowed actions are fairly restricting</li>
<li><code>virtadmins</code> have access to all vms and to all actions</li>
</ul>
</div>
</div>

<div id="outline-container-org0000002" class="outline-3">
<h3 id="org0000002"><span class="section-number-3">2.2.</span> rules</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-javascript">restrictedActions = [
    "connect.getattr",
    "connect.search-domains",
    "connect.read",
    "domain.core-dump",
    "domain.fs-freeze",
    "domain.fs-trim",
    "domain.getattr",
    "domain.hibernate",
    "domain.init-control",
    "domain.inject-nmi",
    "domain.open-device",
    "domain.open-graphics",
    "domain.pm-control",
    "domain.read",
    "domain.read-secure",
    "domain.reset",
    "domain.save",
    "domain.screenshot",
    "domain.send-input",
    "domain.send-signal",
    "domain.set-password",
    "domain.set-time",
    "domain.snapshot",
    "domain.start",
    "domain.stop",
    "domain.suspend",
    "network.getattr",
    "network.read",
    "network-port.create",
    "network-port.read",
];

polkit.addRule(function(action, subject) {
    if (action.id.indexOf("org.libvirt.api.") == 0) {
	var api = action.id.replace("org.libvirt.api.", "");
	var domain = action.lookup("domain_name");

	if (subject.groups.indexOf("virtadmins") &gt;= 0)
	    return polkit.Result.YES;

	if (restrictedActions.indexOf(api) &gt;= 0 &amp;&amp; subject.groups.indexOf("virtusers")) {
		if (!domain || domain.match(new RegExp("^"+subject.user+"-")))
		    return polkit.Result.YES;
	}

	return polkit.Result.NO;
    }
});

polkit.addRule(function(action, subject) {
    if (action.id == "org.libvirt.unix.manage" &amp;&amp;
	(subject.groups.indexOf("virtadmins") &gt;= 0 || subject.groups.indexOf("virtusers") &gt;= 0)) {
	    return polkit.Result.YES;
    }
});
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
